In [2]:
import numpy as np 
import pandas as pd

Creating a dataframe

In [5]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
} #dictionary
#dataframe is mutliple series combined
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [10]:

data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
] #list
#as columns are not provided, they are by default 0,1,2,3
colums = ['Name', "Age", 'City', 'Salary']
df2 = pd.DataFrame(data_list, columns=colums)
#columns is a keyword argument
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

Selection and indexing of column

In [14]:
# df2[0] #throws error as yoou cant access by index, 
#you can access columns by column name 
df2['City']

0    New York
1       Paris
2      Berlin
3      London
Name: City, dtype: object

In [17]:
df2[['City', 'Name']]
#you have to provide a list of list for selecting multiple columns

       City   Name
0  New York   John
1     Paris   Anna
2    Berlin  Peter
3    London  Linda

Creating a new column

In [30]:
df2['designation'] = ["doctor", "engineer", 'consultant', "President"]
#this is how you add a new columns

In [31]:
df2

    Name  Age      City  Salary designation
0   John   28  New York   65000      doctor
1   Anna   34     Paris   70000    engineer
2  Peter   29    Berlin   62000  consultant
3  Linda   42    London   85000   President

Remove a columns

In [32]:
df2.drop('designation', axis = 1)
#axis by default is 0, which works horizontallyabs
#axis = 1, is for vertical
#this drop is showing only snapshot, not actually drop it

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [33]:
df2
#still the designation is not removed

    Name  Age      City  Salary designation
0   John   28  New York   65000      doctor
1   Anna   34     Paris   70000    engineer
2  Peter   29    Berlin   62000  consultant
3  Linda   42    London   85000   President

In [34]:
df2.drop('designation', axis = 1, inplace=True)
#now this permanently removes the column

In [35]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [36]:
df2.drop(['City', 'Age'], axis = 1) #how to remove multiple columns at once

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter   62000
3  Linda   85000

In [37]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [40]:
#dropping a row
df2.drop(0, axis = 0)

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

In [41]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

Selecting Rows

In [43]:
df2.loc[0] #for selecting a row use .loc

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [45]:
df.iloc[2] #indexwise row selection

Name       Peter
Age           29
City      Berlin
Salary     62000
Name: 2, dtype: object

In [46]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

Selecting subsets of Rows and Columns

In [48]:
df2.loc[[0, 1]][['City', 'Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

In [49]:
#selecting peter, linda and their age
df2.loc[[2,3]][['Name', "Age"]]

    Name  Age
2  Peter   29
3  Linda   42

Conditional Selections

In [50]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [52]:
df2[df2["Age"] > 30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [59]:
# df2[df2["Age"] > 30 & df2['City'] == "Paris"] #gives error as both condition must be wrapped inside parenthesis
df2[(df2['City'] == 'Paris') & (df2["Age"] > 30)]

   Name  Age   City  Salary
1  Anna   34  Paris   70000